; domain
(define (domain serveBreakfast)
  (:requirements :strips :conditional-effects  :equality)

  ;; ───── Constants ────
  ;; Fixed objects in the scene
  (:constants bread egg fridge knife plate pan mug toaster stoveburner coffeemachine dining_table counter_1 counter_2 counter_1_l counter_2_l dining_table_l fridge_l default_l)

    ;; ───── Predicate Definitions ─────
    (:predicates
      (at ?loc)                ; Robot is at a specific location
      (on ?obj ?surf)          ; Object is on a surface or device
      (at-location ?obj ?loc) ; e.g., (at-location fridge fridge_l)
      (in ?obj ?cont)          ; Object is inside a container (like the fridge)
      (holding ?obj)           ; Robot is holding an object
      (hand-empty)             ; Robot's hand is empty
      (is-sliced ?obj)         ; Object has been sliced
      (is-toasted ?obj)        ; Object has been toasted
      (is-broken ?obj)
      (is-cooked ?obj)
      (is-filled ?obj)
      (is-on ?device)          ; Device is currently turned on
      (opened ?obj)            ; Container (like the fridge) is open
    )

    ;; ───── Action Definitions ─────
    ;; Move the robot between locations
    (:action move
      :parameters (?from ?to)
      :precondition (and (at ?from))
      :effect (and (not (at ?from)) (at ?to))
    )

    ;; Open a container
    (:action open
      :parameters (?obj ?loc)
      :precondition (and (at ?loc) (at-location ?obj ?loc) (not (opened ?obj)))
      :effect (opened ?obj)
    )

    ;; Pick up an object
    (:action pick
      :parameters (?obj ?container ?loc)
      :precondition (and (at ?loc) (hand-empty) (at-location ?container ?loc) (at-location ?obj ?loc)
                      (or (and (in ?obj ?container) (opened ?container)) (on ?obj ?container))
                      (or (not (= ?obj egg)) (not (is-broken ?obj)))
                    )
      :effect (and (holding ?obj) (not (hand-empty)) (not (at-location ?obj ?loc))
                   (not (in ?obj ?container)) (not (on ?obj ?container)))
    )

    ;; Put down an object
    (:action put
      :parameters (?obj ?container ?loc)
      :precondition (
        and 
        (at ?loc)
        (at-location ?container ?loc) 
        (holding ?obj) 

        (not (= ?container knife)) 
        (not (= ?container egg))
        (not (= ?container bread)) 
        (not (= ?container mug))

        (not (and (= ?obj egg) (= ?container pan) (is-broken ?obj)))
        (not (and (= ?obj egg) (= ?container stoveburner)))

        (or (not (= ?container toaster)) (is-sliced ?obj))
        (or (not (= ?container pan)) (= ?obj egg))
        (or (not (= ?container coffeemachine)) (= ?obj mug))

        (not (and (= ?obj pan) (= ?container fridge)))
        )
      :effect (and (not (holding ?obj)) (hand-empty) (on ?obj ?container) (at-location ?obj ?loc))
    )

    (:action slice
      :parameters (?obj ?loc)
      :precondition (
        and (at ?loc)
        (holding knife) 
        (at-location ?obj ?loc)
        (or (and (= ?obj bread) (on ?obj counter_1))
            (and (= ?obj egg) (on ?obj pan)))
        (exists (?s) (and (on ?obj ?s) (at-location ?s ?loc)))
        (not (is-broken ?obj))
      )
      :effect (and 
          ;; If it's bread, it becomes sliced
          (when (= ?obj bread) (is-sliced bread))
          ;; If it's the egg, it becomes broken
          (when (= ?obj egg) (is-broken egg))
      )
    )

    ;; Turn on a device (to toast the bread)
    (:action turn_on
      :parameters (?device ?loc)
      :precondition (
        and (at ?loc) 
        (at-location ?device ?loc) 
        (not (is-on ?device)) 
        (or (and (= ?device toaster) (on bread toaster))
            (and (= ?device stoveburner) (on pan stoveburner) (on egg pan) (is-broken egg))
            (and (= ?device coffeemachine) (on mug coffeemachine)))
        )
      :effect (
        and (is-on ?device)
        (when (and (= ?device stoveburner) (on pan stoveburner) (on egg pan) (is-broken egg)) (is-cooked egg))
        (when (= ?device toaster) (is-toasted bread))
        (when (and (= ?device coffeemachine) (on mug coffeemachine)) (is-filled mug))
        )
    )
    ;; Turn off a device
    (:action turn_off
      :parameters (?device ?loc)
      :precondition (
        and (at ?loc) 
        (at-location ?device ?loc) 
        (is-on ?device)
        )
      :effect (
        and (not (is-on ?device))
      )
    )
  )

; problem
(define (problem serveBreakfast-totable)
(:domain serveBreakfast)
  (:init
    (at default_l)
    (hand-empty)

    ;; Define which surfaces are at which locations
    (at-location fridge fridge_l)
    (at-location counter_1 counter_1_l)
    (at-location counter_2 counter_2_l)
    (at-location toaster counter_1_l)
    (at-location knife counter_1_l)
    (at-location dining_table dining_table_l)
    (at-location plate dining_table_l)
    (at-location bread fridge_l)
    (at-location egg fridge_l)
    (at-location pan counter_2_l)
    (at-location mug counter_2_l)
    (at-location stoveburner counter_2_l)
    (at-location coffeemachine counter_1_l)
    
    
    ;; Initial containment
    (in bread fridge)
    (in egg fridge)
    (on knife counter_1)
    (on pan counter_2)
    (on mug counter_2)
    (on plate dining_table)
    (on toaster counter_1)
    

  )

  (:goal 
   (and 
     (is-sliced bread) 
     (is-toasted bread)
     (on bread plate)
     (on plate dining_table)

     (on egg pan)  
     (on pan dining_table)        
     (is-cooked egg)
     
     (is-filled mug)
     (on mug dining_table)

    )
  )
)

; plan
1. (move default_l fridge_l)
   deleted: (at default_l)
   added: (at fridge_l)
   goals met: 1 of 9
2. (open fridge fridge_l)
   added: (opened fridge)
   goals met: 1 of 9
3. (pick egg fridge fridge_l)
   deleted: (hand-empty) (at-location egg fridge_l) (in egg fridge)
   added: (holding egg)
   goals met: 1 of 9
4. (move fridge_l counter_2_l)
   deleted: (at fridge_l)
   added: (at counter_2_l)
   goals met: 1 of 9
5. (put egg pan counter_2_l)
   deleted: (holding egg)
   added: (hand-empty) (on egg pan) (at-location egg counter_2_l)
   goals met: 2 of 9
6. (pick pan counter_2 counter_2_l)
   deleted: (hand-empty) (at-location pan counter_2_l) (on pan counter_2)
   added: (holding pan)
   goals met: 2 of 9
7. (put pan stoveburner counter_2_l)
   deleted: (holding pan)
   added: (hand-empty) (on pan stoveburner) (at-location pan counter_2_l)
   goals met: 2 of 9
8. (pick mug counter_2 counter_2_l)
   deleted: (hand-empty) (at-location mug counter_2_l) (on mug counter_2)
   added: (holding mug)
   goals met: 2 of 9
9. (move counter_2_l counter_1_l)
   deleted: (at counter_2_l)
   added: (at counter_1_l)
   goals met: 2 of 9
10. (put mug coffeemachine counter_1_l)
   deleted: (holding mug)
   added: (hand-empty) (on mug coffeemachine) (at-location mug counter_1_l)
   goals met: 2 of 9
11. (turn_on coffeemachine counter_1_l)
   added: (is-on coffeemachine) (is-filled mug)
   goals met: 3 of 9
12. (pick mug coffeemachine counter_1_l)
   deleted: (hand-empty) (at-location mug counter_1_l) (on mug coffeemachine)
   added: (holding mug)
   goals met: 3 of 9
13. (move counter_1_l dining_table_l)
   deleted: (at counter_1_l)
   added: (at dining_table_l)
   goals met: 3 of 9
14. (put mug dining_table dining_table_l)
   deleted: (holding mug)
   added: (hand-empty) (on mug dining_table) (at-location mug dining_table_l)
   goals met: 4 of 9
15. (move dining_table_l fridge_l)
   deleted: (at dining_table_l)
   added: (at fridge_l)
   goals met: 4 of 9
16. (pick bread fridge fridge_l)
   deleted: (hand-empty) (at-location bread fridge_l) (in bread fridge)
   added: (holding bread)
   goals met: 4 of 9
17. (move fridge_l counter_1_l)
   deleted: (at fridge_l)
   added: (at counter_1_l)
   goals met: 4 of 9
18. (put bread counter_1 counter_1_l)
   deleted: (holding bread)
   added: (hand-empty) (on bread counter_1) (at-location bread counter_1_l)
   goals met: 4 of 9
19. (pick knife counter_1 counter_1_l)
   deleted: (hand-empty) (at-location knife counter_1_l) (on knife counter_1)
   added: (holding knife)
   goals met: 4 of 9
20. (slice bread counter_1_l)
   added: (is-sliced bread)
   goals met: 5 of 9
21. (move counter_1_l counter_2_l)
   deleted: (at counter_1_l)
   added: (at counter_2_l)
   goals met: 5 of 9
22. (slice egg counter_2_l)
   added: (is-broken egg)
   goals met: 5 of 9
23. (turn_on stoveburner counter_2_l)
   added: (is-on stoveburner) (is-cooked egg)
   goals met: 6 of 9
24. (put knife counter_2 counter_2_l)
   deleted: (holding knife)
   added: (hand-empty) (on knife counter_2) (at-location knife counter_2_l)
   goals met: 6 of 9
25. (pick pan stoveburner counter_2_l)
   deleted: (hand-empty) (at-location pan counter_2_l) (on pan stoveburner)
   added: (holding pan)
   goals met: 6 of 9
26. (move counter_2_l dining_table_l)
   deleted: (at counter_2_l)
   added: (at dining_table_l)
   goals met: 6 of 9
27. (put pan dining_table dining_table_l)
   deleted: (holding pan)
   added: (hand-empty) (on pan dining_table) (at-location pan dining_table_l)
   goals met: 7 of 9
28. (move dining_table_l counter_1_l)
   deleted: (at dining_table_l)
   added: (at counter_1_l)
   goals met: 7 of 9
29. (pick bread counter_1 counter_1_l)
   deleted: (hand-empty) (at-location bread counter_1_l) (on bread counter_1)
   added: (holding bread)
   goals met: 7 of 9
30. (put bread toaster counter_1_l)
   deleted: (holding bread)
   added: (hand-empty) (on bread toaster) (at-location bread counter_1_l)
   goals met: 7 of 9
31. (turn_on toaster counter_1_l)
   added: (is-on toaster) (is-toasted bread)
   goals met: 8 of 9
32. (pick bread toaster counter_1_l)
   deleted: (hand-empty) (at-location bread counter_1_l) (on bread toaster)
   added: (holding bread)
   goals met: 8 of 9
33. (move counter_1_l dining_table_l)
   deleted: (at counter_1_l)
   added: (at dining_table_l)
   goals met: 8 of 9
34. (put bread plate dining_table_l)
   deleted: (holding bread)
   added: (hand-empty) (on bread plate) (at-location bread dining_table_l)
   goals met: 9 of 9
